app/Modules/Blog/Models/PostModel.php

    public function getPublishedByLang(string $lang, int $page = 1, int $perPage = 12): array
    {
        $offset = ($page - 1) * $perPage;

        return $this->select('posts.*, categories.name as category_name')
            ->join('categories', 'categories.id = posts.category_id', 'left')
            ->where('posts.lang', $lang)
            ->where('posts.status', 'published')
            ->where('posts.deleted_at IS NULL', null, false)
            ->orderBy('posts.published_at', 'DESC')
            ->limit($perPage, $offset)
            ->findAll();
---
SELECT `posts`.*, `categories`.`name` as `category_name`
FROM `posts`
LEFT JOIN `categories` ON `categories`.`id` = `posts`.`category_id`
WHERE `posts`.`lang` = 'tr'
AND `posts`.`status` = 'published'
AND posts.deleted_at IS NULL
AND `posts`.`deleted_at` IS NULL
ORDER BY `posts`.`published_at` DESC
 LIMIT 3