app/Core/Settings/SettingsService.php

    private function loadAll(): void
    {
        if (self::$loaded) {
            return;
        }

        // Önce CI4 cache'den dene
        $cached = cache()->get('settings_all');

        if ($cached !== null) {
            self::$cache  = $cached;
            self::$loaded = true;
            return;
        }

        $rows = $this->db->table('settings')->get()->getResultArray();
---
SELECT *
FROM `settings`